adafruit/Adafruit_nRF52_Bootloader/lib/sdk11/components/libraries/bootloader_dfu/dfu_single_bank.c
            m_data_received += data_length;

            if (m_data_received != m_image_size)
            {
                // The entire image is not received yet. More data is expected.
                err_code = NRF_ERROR_INVALID_LENGTH;
            }
            else
            {
              if ( !is_ota() ) flash_nrf5x_flush(false);

              // The entire image has been received. Return NRF_SUCCESS.
              err_code = NRF_SUCCESS;
            }
            break;

        default:
            err_code = NRF_ERROR_INVALID_STATE;
            break;
    }

    return err_code;
}


uint32_t dfu_init_pkt_complete(void)
{
    uint32_t err_code = NRF_ERROR_INVALID_STATE;
    
    // DFU initialization has been done and a start packet has been received.
    if (IMAGE_WRITE_IN_PROGRESS())
    {
        // Image write is already in progress. Cannot handle an init packet now.
        return NRF_ERROR_INVALID_STATE;
    }
    
    if (m_dfu_state == DFU_STATE_RX_INIT_PKT)
    {
        err_code = dfu_init_prevalidate(m_init_packet, m_init_packet_length, m_start_packet.dfu_update_mode);
        if (err_code == NRF_SUCCESS)
        {
            m_dfu_state = DFU_STATE_RX_DATA_PKT;
        }
        else
        {
            m_init_packet_length = 0;
        }
    }
    return err_code;
}


uint32_t dfu_init_pkt_handle(dfu_update_packet_t * p_packet)
{
    uint32_t length;

    switch (m_dfu_state)
    {
        case DFU_STATE_RDY:
            m_dfu_state = DFU_STATE_RX_INIT_PKT;
            // When receiving init packet in state ready just update and fall through this case.
            /* FALLTHRU */

        case DFU_STATE_RX_INIT_PKT:
            // DFU initialization has been done and a start packet has been received.
            if (IMAGE_WRITE_IN_PROGRESS())
            {
                // Image write is already in progress. Cannot handle an init packet now.
                return NRF_ERROR_INVALID_STATE;
            }

            length = p_packet->params.data_packet.packet_length * sizeof(uint32_t);
            if ((m_init_packet_length + length) > sizeof(m_init_packet))
            {
                return NRF_ERROR_INVALID_LENGTH;
            }

            memcpy(&m_init_packet[m_init_packet_length],
                   &p_packet->params.data_packet.p_data_packet[0],
                   length);
            m_init_packet_length += length;
            break;

        default:
            // Either the start packet was not received or dfu_init function was not called before.
            return NRF_ERROR_INVALID_STATE;
    }

    return NRF_SUCCESS;
}


uint32_t dfu_image_validate()
{
    uint32_t err_code;

    switch (m_dfu_state)
    {
        case DFU_STATE_RX_DATA_PKT:
            // Check if the application image write has finished.
            if (m_data_received != m_image_size)
            {
                // Image not yet fully transfered by the peer or the peer has attempted to write
                // too much data. Hence the validation should fail.
                err_code = NRF_ERROR_INVALID_STATE;
            }
            else
            {
                m_dfu_state = DFU_STATE_VALIDATE;

                err_code = dfu_init_postvalidate((uint8_t *)mp_storage_handle_active->block_id, m_image_size);
                VERIFY_SUCCESS(err_code);
                m_dfu_state = DFU_STATE_WAIT_4_ACTIVATE;
            }
            break;

        default:
            err_code = NRF_ERROR_INVALID_STATE;
            break;
    }

    return err_code;
}


uint32_t dfu_image_activate()
{
    uint32_t err_code;

    switch (m_dfu_state)
    {
        case DFU_STATE_WAIT_4_ACTIVATE:
            err_code = m_functions.activate();
            break;

        default:
            err_code = NRF_ERROR_INVALID_STATE;
            break;
    }

    return err_code;
}


void dfu_reset(void)
{
    dfu_update_status_t update_status;

    update_status.status_code = DFU_RESET;

    bootloader_dfu_update_process(update_status);
}


#if DFU_EXTERNAL_FLASH
static const nrfx_qspi_config_t qspi_config = NRFX_QSPI_DEFAULT_CONFIG(QSPI_SCK, QSPI_CS, QSPI_DATA0, QSPI_DATA1, QSPI_DATA2, QSPI_DATA3);

nrfx_err_t dfu_init_qspi_flash(void) {
    static bool inited = false;
    uint32_t err_code = NRFX_SUCCESS;
    if (!inited) {
        // use blocking mode for simplicity
        err_code = nrfx_qspi_init(&qspi_config, NULL, NULL);
        if (err_code==NRFX_SUCCESS) {
            inited = true;
        }
        NRFX_DELAY_MS(5);
    }
    return err_code;
}

uint32_t dfu_external_begin_pkt_handle(dfu_update_packet_t* p_packet) {
    if (dfu_init_qspi_flash()!=NRFX_SUCCESS)
        return NRF_ERROR_BUSY;
    return NRF_SUCCESS;
}

uint32_t dfu_external_end_pkt_handle(dfu_update_packet_t* p_packet) {
    // this crashes the device. reason unknown.
    //nrfx_qspi_uninit();
    return NRF_SUCCESS;
}


dfu_erase_packet_t* m_erase_pkt;
uint32_t dfu_erase_pkt_handle(dfu_erase_packet_t * p_packet)
{
    VERIFY_PARAM_NOT_NULL(p_packet);
    m_erase_pkt = p_packet;

    if (m_erase_pkt->memory_region != DFU_MEMORY_EXTERNAL_FLASH) {
        return NRF_ERROR_NOT_SUPPORTED;
    }

    dfu_init_qspi_flash();
    while (m_erase_pkt->length) {
        if (m_erase_pkt->length < 4096) {
            return NRF_ERROR_INVALID_LENGTH;
        }
        if (nrfx_qspi_erase((m_erase_pkt->length>4096) ? NRF_QSPI_ERASE_LEN_64KB : NRF_QSPI_ERASE_LEN_4KB, m_erase_pkt->address)!=NRFX_SUCCESS)
            return NRF_ERROR_NOT_FOUND;
        const uint32_t block_size = (m_erase_pkt->length>4096) ? 64*1024 : 4*1024;
        m_erase_pkt->length -= block_size;
        m_erase_pkt->address += block_size;
    }
    return NRF_SUCCESS;
}

#define XIP_BASE (0x12000000)

uint32_t dfu_write_pkt_handle(dfu_write_packet_t * p_packet)
{
    VERIFY_PARAM_NOT_NULL(p_packet);

    if (p_packet->memory_region != DFU_MEMORY_EXTERNAL_FLASH) {
        return NRF_ERROR_NOT_SUPPORTED;
    }
    dfu_init_qspi_flash();

    unsigned retries = 5;

    uint32_t remaining = p_packet->length;
    uint32_t address = p_packet->address;
    const char* data = (const char*)p_packet->data;
    uint32_t error = NRF_ERROR_NOT_FOUND;

    while (retries-->0 && error != NRF_SUCCESS) {
        // the nrfx interface uses error codes in a different range of numbers, so these need to be mapped
        // to regular nrf error codes
        if (nrfx_qspi_write(data, remaining, address)!=NRFX_SUCCESS) {
            error = NRF_ERROR_NOT_FOUND;
        }
        else {
            // verify against the xip region
            if (memcmp(data, (void*)(XIP_BASE+address), remaining))
                error = NRF_ERROR_INVALID_DATA;
            else
                error = NRF_SUCCESS;
        }
    }
    return error;
}

uint32_t dfu_checksum_pkt_handle(dfu_checksum_packet_t * p_packet)
{
    VERIFY_PARAM_NOT_NULL(p_packet);

    if (p_packet->memory_region != DFU_MEMORY_EXTERNAL_FLASH) {
        return NRF_ERROR_NOT_SUPPORTED;
    }

    return NRF_SUCCESS;
}

#endif

static uint32_t dfu_compare_block(uint32_t * ptr1, uint32_t * ptr2, uint32_t len)
{
    sd_mbr_command_t sd_mbr_cmd;

    sd_mbr_cmd.command             = SD_MBR_COMMAND_COMPARE;
    sd_mbr_cmd.params.compare.ptr1 = ptr1;
    sd_mbr_cmd.params.compare.ptr2 = ptr2;
    sd_mbr_cmd.params.compare.len  = len / sizeof(uint32_t);

    return sd_mbr_command(&sd_mbr_cmd);
}


static uint32_t dfu_copy_sd(uint32_t * src, uint32_t * dst, uint32_t len)
{
    sd_mbr_command_t sd_mbr_cmd;

    sd_mbr_cmd.command            = SD_MBR_COMMAND_COPY_SD;
    sd_mbr_cmd.params.copy_sd.src = src;
    sd_mbr_cmd.params.copy_sd.dst = dst;
    sd_mbr_cmd.params.copy_sd.len = len / sizeof(uint32_t);

    return sd_mbr_command(&sd_mbr_cmd);
}


